a = int(23)
print("I am %d years old" %a)
# %d برای اعداد      -  (%03d)-> 002
# %s برای رشته
# %f برای اعشاری     -  (%.2f)-> 1.81
--------------------------------
c, d = input().split()
ورودی کلمه اول در سی و کلمه دوم در دی قرار میگیرد
تابع اسپلیت() به صورت پیفرض رشته را در جاهایی که فاصله وجود دارد جدا میکند 
اما در صورت نیاز می‌توانید با ورودی اسپلیت('-') رشته را در جایی که کاراکتر '-' وجود دارد جدا کنید
--------------------------------
a, b, c, d, e, f, g = map(int, input().split())
روشی بهتر (یک خطی) برای کست کردن همزمان تعدادی متغیر!
فرض کنید میخواهیم ۷ متغیر از جنس اینت را که با فاصله از هم جدا شده اند را از ورودی دریافت کنیم، اگر به شکل بالا عمل کنیم لازم است در ۸ خط اینکار را انجام دهیم. (یک خط برای دریافت ورودی و ۷ خط برای کَست کردن متغیر ها به جنس اینت) بجای آن ۸ خط کافیست یک خط کد زیر را بنویسیم :)
